### Class practice on 04/06/2024 - Advanced python programming
##### Prajwal Luitel (C0927658)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

## Lecture 4
#### Python for data transformation

In [2]:
titanic_df = pd.read_csv("./titanic.csv")
titanic_df.head()

,name,gender,age,class,embarked,country,ticketno,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,5547.0,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,2673.0,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,2673.0,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,2673.0,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,348125.0,7.13,0.0,0.0,yes

In [4]:
titanic_df.shape

(2207, 11)

In [5]:
titanic_df.isnull().mean()

name        0.000000
gender      0.000000
age         0.000906
class       0.000000
embarked    0.000000
country     0.036701
ticketno    0.403715
fare        0.415043
sibsp       0.407793
parch       0.407793
survived    0.000000
dtype: float64

In [7]:
titanic_df.describe()

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
25%      22.000000  1.426225e+04     7.180600     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
75%      38.000000  3.470770e+05    31.060750     1.000000     0.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [8]:
titanic_df.describe(percentiles = [0.01,.1,.2,.3,.5,.6,.7,.8,.9,.99])

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
1%        2.000000  7.668500e+02     6.150000     0.000000     0.000000
10%      18.000000  2.668000e+03     7.140800     0.000000     0.000000
20%      21.000000  1.166800e+04     7.170600     0.000000     0.000000
30%      24.000000  1.758100e+04     8.010000     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
60%      32.000000  2.376680e+05    22.070200     0.000000     0.000000
70%      36.000000  3.309755e+05    27.140500     1.000000     0.000000
80%      40.000000  3.492170e+05    42.080000     1.000000     1.000000
90%      46.000000  3.686375e+05    78.050400     1.000000     2.000000
99%      63.000000  3.101304e+06   262.070600     5.000000     4.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [9]:
titanic_df['age'].quantile(0.01)

2.0

In [10]:
titanic_df.drop('ticketno', axis=1).head(1)

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no

In [11]:
del titanic_df['ticketno']

titanic_df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

### Navigating through a dataframe

In [12]:
titanic_df.at[0,'age']

42.0

In [14]:
titanic_df.at[0,'age'] = 52

titanic_df.at[0,'age']

52.0

In [15]:
titanic_df.at[0,'age']

52.0

In [13]:
# get index name
titanic_df.index.name

In [16]:
titanic_df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [17]:
titanic_df.loc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

#### Setting the index

In [18]:
titanic_df.set_index(titanic_df['name'], inplace=True)
titanic_df.index.name

'name'

In [19]:
titanic_df.loc['Abbott, Mr. Eugene Joseph']

name        Abbott, Mr. Eugene Joseph
gender                           male
age                              13.0
class                             3rd
embarked                            S
country                 United States
fare                            20.05
sibsp                             0.0
parch                             2.0
survived                           no
Name: Abbott, Mr. Eugene Joseph, dtype: object

In [20]:
# doesn't work as index is not a number
titanic_df.iloc['Abbott, Mr. Eugene Joseph']

TypeError: Cannot index by location index with a non-integer key

In [21]:
titanic_df.loc[1:4]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

In [22]:
titanic_df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
name,,,,,,,,,,
"Abbott, Mr. Eugene Joseph","Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
"Abbott, Mr. Rossmore Edward","Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
"Abbott, Mrs. Rhoda Mary 'Rosa'","Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [23]:
titanic_df.reset_index(drop=True, inplace=True)
titanic_df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

#### Selecting rows based on conditions

In [24]:
titanic_df[titanic_df['gender']=='female'].shape

(489, 10)

In [25]:
# create a sub table
female_df = titanic_df[titanic_df['gender']=='female']
female_df.shape

(489, 10)

In [27]:
# Create a sub-table with multiple conditions using logical and
female_more_than_fifty = titanic_df.query("gender=='female' and age > 50 ")
female_more_than_fifty.shape

(36, 10)

In [28]:
# Creating sub table with multiple conditions using logical or
female_or_more_than_fifty = titanic_df.query("gender == 'female' or age >50")
female_or_more_than_fifty.shape

(586, 10)

In [30]:
# Creating sub table with multiple conditions using logical or and logical and
female_greater_fifty_male_less_twenty = titanic_df.query(f"(gender =='female' and age>50) or (gender=='male' and age<20) ")
female_greater_fifty_male_less_twenty.shape

(244, 10)

#### Adjusting dataframe

In [31]:
titanic_df['gender'].replace(['female','male'], ['W','M']).head(5)

0    M
1    M
2    M
3    W
4    W
Name: gender, dtype: object

In [32]:
# creting new column
titanic_df['sex'] = titanic_df['gender'].replace(['female', 'male'],[1,0])
titanic_df['sex'].value_counts()

sex
0    1718
1     489
Name: count, dtype: int64

In [33]:
titanic_df['gender'].value_counts(dropna=False)

gender
male      1718
female     489
Name: count, dtype: int64

In [34]:
titanic_df['survived_ind'] = titanic_df['survived'].replace(['yes', 'no'], [1,0])
titanic_df.survived_ind.value_counts(dropna=False)

survived_ind
0    1496
1     711
Name: count, dtype: int64

In [35]:
titanic_df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no,0,0
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no,0,0
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no,0,0
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes,1,1
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes,1,1

#### Crosstabs

In [36]:
pd.crosstab(titanic_df['sex'], titanic_df['gender'], margins=True, margins_name="total")

gender  female  male  total
sex
0            0  1718   1718
1          489     0    489
total      489  1718   2207

In [42]:
crosstab = pd.crosstab(titanic_df['survived'], titanic_df['gender'], margins=True, margins_name="total")
crosstab

gender    female  male  total
survived
no           130  1366   1496
yes          359   352    711
total        489  1718   2207

In [43]:
crosstab = pd.crosstab(titanic_df['survived'], [titanic_df['gender'], titanic_df['class']], margins=True, margins_name="total")
crosstab

gender   female                                             male            \
class       1st  2nd  3rd restaurant staff victualling crew  1st  2nd  3rd
survived
no            5   12  110                0                3  118  154  418
yes         139   94  106                2               18   62   24   75
total       144  106  216                2               21  180  178  493

gender                                                                total
class    deck crew engineering crew restaurant staff victualling crew
survived
no              23              253               66              334  1496
yes             43               71                1               76   711
total           66              324               67              410  2207

#### Renaming a column

In [44]:
titanic_df.rename(columns={'class':'passenger_class'}, inplace=True)
titanic_df.head(1)

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no,0,0

#### Counting missing values

In [45]:
titanic_df[titanic_df['age'].isnull()].shape[0]

2

In [46]:
type(titanic_df[titanic_df['age'].notna()].shape)

tuple

In [47]:
titanic_df[titanic_df['age'].notna()].shape

(2205, 12)

In [48]:
titanic_df[titanic_df['age'].isnull()==False].shape[0]

2205

In [49]:
titanic_df.query("age.isnull()")

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind
439,"Gheorgheff, Mr. Stanio",male,NaN,3rd,C,Bulgaria,7.1711,0.0,0.0,no,0,0
677,"Kraeff, Mr. Theodor",male,NaN,3rd,C,Bulgaria,7.1711,0.0,0.0,no,0,0

#### Unique value

In [50]:
titanic_df['country'].nunique()

48

In [51]:
titanic_df['country'].unique()

array(['United States', 'England', 'Norway', 'France', 'Lebanon',
       'Finland', 'Sweden', 'Argentina', 'Canada', 'Denmark',
       'Northern Ireland', 'Bulgaria', 'Switzerland', 'Channel Islands',
       'Bosnia', 'Hungary', nan, 'Ireland', 'Italy', 'India', 'Wales',
       'South Africa', 'Croatia (Modern)', 'Scotland', 'Siam', 'Uruguay',
       'Belgium', 'Poland', 'Australia', 'Peru', 'Spain', 'Egypt',
       'Japan', 'Syria', 'Russia', 'Slovenia', 'Greece', 'Turkey',
       'China/Hong Kong', 'Austria', 'Latvia', 'Yugoslavia',
       'Slovakia (Modern day)', 'Germany', 'Croatia', 'Cuba',
       'Netherlands', 'Mexico', 'Guyana'], dtype=object)

In [52]:
titanic_df['country'].value_counts(dropna=False)

country
England                  1125
United States             264
Ireland                   137
Sweden                    105
NaN                        81
Lebanon                    71
Finland                    54
Scotland                   36
Canada                     34
France                     26
Norway                     26
Belgium                    22
Northern Ireland           21
Wales                      20
Bulgaria                   19
Switzerland                18
Channel Islands            17
Croatia (Modern)           12
Croatia                    11
Italy                      11
Spain                       9
India                       8
Hungary                     7
Denmark                     7
Argentina                   7
South Africa                6
Germany                     6
Turkey                      6
Australia                   5
Slovenia                    4
Bosnia                      4
Poland                      3
Austria                     3
Netherlands                 2
Greece                      2
Siam                        2
Russia                      2
Peru                        2
Uruguay                     2
Syria                       1
China/Hong Kong             1
Japan                       1
Latvia                      1
Yugoslavia                  1
Slovakia (Modern day)       1
Egypt                       1
Cuba                        1
Mexico                      1
Guyana                      1
Name: count, dtype: int64

In [59]:
crosstab= pd.crosstab( titanic_df['country'],titanic_df['survived_ind'], margins=True, margins_name='total')
crosstab

survived_ind              0    1  total
country
Argentina                 7    0      7
Australia                 5    0      5
Austria                   2    1      3
Belgium                  17    5     22
Bosnia                    4    0      4
Bulgaria                 19    0     19
Canada                   19   15     34
Channel Islands           9    8     17
China/Hong Kong           0    1      1
Croatia                  11    0     11
Croatia (Modern)         10    2     12
Cuba                      1    0      1
Denmark                   6    1      7
Egypt                     0    1      1
England                 831  294   1125
Finland                  37   17     54
France                   11   15     26
Germany                   3    3      6
Greece                    2    0      2
Guyana                    1    0      1
Hungary                   6    1      7
India                     2    6      8
Ireland                  90   47    137
Italy                     9    2     11
Japan                     0    1      1
Latvia                    1    0      1
Lebanon                  40   31     71
Mexico                    1    0      1
Netherlands               2    0      2
Northern Ireland         17    4     21
Norway                   19    7     26
Peru                      1    1      2
Poland                    1    2      3
Russia                    1    1      2
Scotland                 28    8     36
Siam                      0    2      2
Slovakia (Modern day)     1    0      1
Slovenia                  3    1      4
South Africa              4    2      6
Spain                     2    7      9
Sweden                   77   28    105
Switzerland               7   11     18
Syria                     0    1      1
Turkey                    4    2      6
United States           112  152    264
Uruguay                   2    0      2
Wales                    17    3     20
Yugoslavia                1    0      1
total                  1443  683   2126

In [61]:
# For each row, add a column which is percentage of survival
crosstab['percentage'] = (crosstab[1]/crosstab['total'])*100
crosstab

survived_ind              0    1  total  percentage
country
Argentina                 7    0      7    0.000000
Australia                 5    0      5    0.000000
Austria                   2    1      3   33.333333
Belgium                  17    5     22   22.727273
Bosnia                    4    0      4    0.000000
Bulgaria                 19    0     19    0.000000
Canada                   19   15     34   44.117647
Channel Islands           9    8     17   47.058824
China/Hong Kong           0    1      1  100.000000
Croatia                  11    0     11    0.000000
Croatia (Modern)         10    2     12   16.666667
Cuba                      1    0      1    0.000000
Denmark                   6    1      7   14.285714
Egypt                     0    1      1  100.000000
England                 831  294   1125   26.133333
Finland                  37   17     54   31.481481
France                   11   15     26   57.692308
Germany                   3    3      6   50.000000
Greece                    2    0      2    0.000000
Guyana                    1    0      1    0.000000
Hungary                   6    1      7   14.285714
India                     2    6      8   75.000000
Ireland                  90   47    137   34.306569
Italy                     9    2     11   18.181818
Japan                     0    1      1  100.000000
Latvia                    1    0      1    0.000000
Lebanon                  40   31     71   43.661972
Mexico                    1    0      1    0.000000
Netherlands               2    0      2    0.000000
Northern Ireland         17    4     21   19.047619
Norway                   19    7     26   26.923077
Peru                      1    1      2   50.000000
Poland                    1    2      3   66.666667
Russia                    1    1      2   50.000000
Scotland                 28    8     36   22.222222
Siam                      0    2      2  100.000000
Slovakia (Modern day)     1    0      1    0.000000
Slovenia                  3    1      4   25.000000
South Africa              4    2      6   33.333333
Spain                     2    7      9   77.777778
Sweden                   77   28    105   26.666667
Switzerland               7   11     18   61.111111
Syria                     0    1      1  100.000000
Turkey                    4    2      6   33.333333
United States           112  152    264   57.575758
Uruguay                   2    0      2    0.000000
Wales                    17    3     20   15.000000
Yugoslavia                1    0      1    0.000000
total                  1443  683   2126   32.126058

In [63]:
crosstab.sort_values(['total', 'percentage'], ascending=False)

survived_ind              0    1  total  percentage
country
total                  1443  683   2126   32.126058
England                 831  294   1125   26.133333
United States           112  152    264   57.575758
Ireland                  90   47    137   34.306569
Sweden                   77   28    105   26.666667
Lebanon                  40   31     71   43.661972
Finland                  37   17     54   31.481481
Scotland                 28    8     36   22.222222
Canada                   19   15     34   44.117647
France                   11   15     26   57.692308
Norway                   19    7     26   26.923077
Belgium                  17    5     22   22.727273
Northern Ireland         17    4     21   19.047619
Wales                    17    3     20   15.000000
Bulgaria                 19    0     19    0.000000
Switzerland               7   11     18   61.111111
Channel Islands           9    8     17   47.058824
Croatia (Modern)         10    2     12   16.666667
Italy                     9    2     11   18.181818
Croatia                  11    0     11    0.000000
Spain                     2    7      9   77.777778
India                     2    6      8   75.000000
Denmark                   6    1      7   14.285714
Hungary                   6    1      7   14.285714
Argentina                 7    0      7    0.000000
Germany                   3    3      6   50.000000
South Africa              4    2      6   33.333333
Turkey                    4    2      6   33.333333
Australia                 5    0      5    0.000000
Slovenia                  3    1      4   25.000000
Bosnia                    4    0      4    0.000000
Poland                    1    2      3   66.666667
Austria                   2    1      3   33.333333
Siam                      0    2      2  100.000000
Peru                      1    1      2   50.000000
Russia                    1    1      2   50.000000
Greece                    2    0      2    0.000000
Netherlands               2    0      2    0.000000
Uruguay                   2    0      2    0.000000
China/Hong Kong           0    1      1  100.000000
Egypt                     0    1      1  100.000000
Japan                     0    1      1  100.000000
Syria                     0    1      1  100.000000
Cuba                      1    0      1    0.000000
Guyana                    1    0      1    0.000000
Latvia                    1    0      1    0.000000
Mexico                    1    0      1    0.000000
Slovakia (Modern day)     1    0      1    0.000000
Yugoslavia                1    0      1    0.000000